Repository: PaddlePaddle/PaddleTS
Catalog: docs/locale/*/LC_MESSAGES/source/api/paddlets.models.anomaly.*.adapter.data_adapter.po
Languages: ml

source: Internal method that takes in a batch of data and puts the elements within the batch into a container (e.g. python built-in dict container) with an additional outer dimension - batch size.
ml: 默认的小批量样本整合函数，输入为一个小批量的样本数据，输出会将这些样本放入一个数据容器（例如python内置字典）， 返回的结果会额外增加一个batch_size维度。

source: This is for collating a list of anomaly samples to mini-batches according to the passed batch_size param.
ml: 该函数用于将一个小批量的输入样本基于默认的整合逻辑，构建为一个小批量样本batch。

source: A batch of data to collate.
ml: 一个等待被整合的小批量样本数据。

source: A collated batch of data with an additional outer dimension - batch size.
ml: 已经整合完成的小批量样本数据，其包含一个额外的batch_size维度。

source: Data adapter, converts TSDataset to MLDataset and MLDataLoader.
ml: 数据转换类，用于将TSDataset数据集转换为MLDataset样本数据集和MLDataLoader样本数据批量加载器。

source: Convert TSDataset to MLDataset.
ml: 将TSDataset数据集转换为MLDataset样本数据集。

source: Raw TSDataset to be converted.
ml: 待转换的TSDataset数据集。

source: The size of the loopback window, i.e., the number of time steps feed to the model.
ml: 模型输入的时间序列长度。

source: Time steps to stride over the i-th sample and (i+1)-th sample. More precisely, let `t` be the time index of target time series, `t[i]` be the start time of the i-th sample, `t[i+1]` be the start time of the (i+1)-th sample, then `sampling_stride` represents the result of `t[i+1] - t[i]`.
ml: 在第i条样本和第i+1条样本之间跨越的时间步数。 具体来说，令 `t` 为target时序数据的时间索引，`t[i]` 为第i条样本的起始时间，`t[i+1]`为第i+1条样本的起始时间， 则`sampling_stride`代表 `t[i+1] - t[i]` 的计算结果，即2条相邻的样本之间相差的时间点的数量。

source: A built MLDataset.
ml: 构建完成的 MLDataset 实例。

source: Convert MLDataset to MLDataLoader.
ml: 将MLDataset样本数据集转换为MLDataLoader样本批量加载器。

source: MLDataset to be converted.
ml: 待转换的MLDataset样本数据集。

source: Number of samples for a single batch.
ml: 单个批量数据中包含的样本数量。

source: User defined collate function for each batch.
ml: 用户自定义的单批量样本整合函数，可选参数。

source: A built MLDataLoader.
ml: 构建完成的MLDataLoader样本批量加载器。
