Repository: PaddlePaddle/PaddleTS
Catalog: docs/locale/*/LC_MESSAGES/source/api/paddlets.models.*_model_wrapper.po
Languages: ml

source: Time series model base wrapper for third party models.
ml: 用于将第三方模型封装为时序模型的基类。

source: Class type of the third party model.
ml: 第三方模型类的类型。

source: The size of the loopback window, i.e., the number of time steps feed to the model.
ml: 模型输入的时间序列长度。

source: The size of the forecasting horizon, i.e., the number of time steps output by the model.
ml: 模型输出的时间序列长度。

source: The number of time steps between in_chunk and out_chunk for a single sample. The skip chunk is neither used as a feature (i.e. X) nor a label (i.e. Y) for a single sample. By default, it will NOT skip any time steps.
ml: 输入序列与输出序列之间跳过的序列长度, 既不作为特征也不作为序测目标使用, 默认值为0。

source: Time steps to stride over the i-th sample and (i+1)-th sample. More precisely, let `t` be the time index of target time series, `t[i]` be the start time of the i-th sample, `t[i+1]` be the start time of the (i+1)-th sample, then `sampling_stride` represents the result of `t[i+1] - t[i]`.
ml: 在第i条样本和第i+1条样本之间跨越的时间步数。 具体来说，令 `t` 为target时序数据的时间索引，`t[i]` 为第i条样本的起始时间，`t[i+1]`为第i+1条样本的起始时间， 则`sampling_stride`代表 `t[i+1] - t[i]` 的计算结果，即2条相邻的样本之间相差的时间点的数量。

source: All params for initializing the third party model.
ml: 用于初始化第三方模型的所有参数。

source: All params for fitting third party model except x_train / y_train.
ml: 第三方模型的fit接口接收的所有参数，训练集数据除外。

source: All params for forecasting third party model except x_test / y_test.
ml: 第三方模型的predict接口接收的所有参数，待预测数据除外。

source: Time series model wrapper for sklearn third party models.
ml: 用于将sklearn第三方模型封装为时序模型的基类。

source: User defined function for converting MLDataLoader object to a numpy.ndarray object that can be processed by `fit` method of the third party model.
ml: 用户自定义函数，用于将一个 MLDataLoader 对象转换为第三方模型的`fit`接口可接收的 numpy.ndarray 类型数据。

source: User defined function for converting MLDataLoader object to a numpy.ndarray object that can be processed by `predict` method of the third party model.
ml: 用户自定义函数，用于将一个 MLDataLoader 对象转换为第三方模型的`predict`接口可接收的 numpy.ndarray 类型数据。

source: Fit a machine learning model.
ml: 训练一个机器学习模型。

source: training dataset.
ml: 训练集。

source: validation dataset.
ml: 验证集。

source: Make prediction.
ml: 预测。

source: TSDataset to predict.
ml: 待预测的时序数据集。

source: TSDataset with predictions.
ml: 包含预测结果的时序数据集。

source: Default function for converting MLDataLoader to a numpy array that can be used for fitting the sklearn model.
ml: 默认的转换函数，用于将一个 MLDataLoader 对象转换为sklearn第三方模型`fit`接口可接收的 numpy.ndarray 类型数据。

source: MLDataLoader object to be converted.
ml: 待转换的 MLDataLoader 对象。

source: parameters when initializing sklearn models, possibly be used while converting.
ml: 初始化sklearn模型时需要提供的参数。在数据转换时可能会用到。

source: The size of the loopback window, i.e., the number of time steps feed to the model. Possibly be used while converting.
ml: 模型输入的时间序列长度。在数据转换时可能会用到。

source: The number of time steps between in_chunk and out_chunk for a single sample. The skip chunk is neither used as a feature (i.e. X) nor a label (i.e. Y) for a single sample. By default, it will NOT skip any time steps. Possibly be used while converting.
ml: 输入序列与输出序列之间跳过的序列长度, 既不作为特征也不作为序测目标使用, 默认值为0。转换期间可能会用到。

source: The size of the forecasting horizon, i.e., the number of time steps output by the model. Possibly be used while converting.
ml: 模型输出的时间序列长度。在数据转换时可能会用到。

source: Converted numpy array. The first and second element in the tuple represent x_train and y_train, respectively.
ml: 转换得到的 numpy array 数据。元组的第一、第二个元素分别代表x_train 和 y_train。

source: Default function for converting MLDataLoader to a numpy array that can be predicted by the sklearn model.
ml: 默认的转换函数，用于将一个 MLDataLoader 对象转换为sklearn第三方模型`predict`接口可接收的 numpy.ndarray 类型数据。

source: Converted numpy array. The first and second element in the tuple represent x and y, respectively, where y is optional.
ml: 转换得到的 numpy array 数据。元组的第一、第二个元素分别代表 x 和 y，其中 y 可能为None。

source: Time series model wrapper for pyod third party models.
ml: 用于将pyod第三方模型封装为时序模型的基类。

source: Predict raw anomaly scores of tsdataset using the fitted model, outliers are assigned with higher scores.
ml: 使用训练完成的模型对输入的时序数据集预测得到原始的异常分数，高分预测结果将会被标记为异常点。

source: The input samples for which will be computed.
ml: 待计算的输入样本。

source: numpy array of shape (n_samples,), the anomaly score of the input samples.
ml: 一个shape为 (n_samples, )的numpy向量，代表数据样本的异常分数。

source: validation dataset. Not used, present for API consistency by convention.
ml: 验证集。该方法暂未使用，出于接口一致性考虑，保留此参数。

source: Default function for converting MLDataLoader to a numpy array that can be used for fitting the pyod model.
ml: 默认的转换函数，用于将一个 MLDataLoader 对象转换为pyod第三方模型`fit`接口可接收的 numpy.ndarray 类型数据。

source: In this method will remove in_chunk_len dimension for the passed data. The reason is that all models in pyod requires X.ndim must == (n_samples, n_features), where n_samples is identical to batch_size, n_features is identical to observed_cov_col_num (In paddlets context, we define n_samples as batch_size, define n_features as observed_cov_col_num for anomaly detection models). However, the samples built by data adapter are 3-dim ndarray with shape of (batch_size, in_chunk_len, observed_cov_col_num), thus needs to flatten (i.e. remove) the first dimension (i.e., batch_size) and make it a 2-dim array.
ml: 该方法中会移除输入数据的 in_chunk_len 维度。原因是所有pyod三方模型要求X维度必须为 (n_samples, n_features)，其中n_samples、n_features分别与PaddleTS中的batch_size、observed_cov_col_num概念相同。但是PaddleTS构建的样本是一个三维的ndarray向量，其shape为(batch_size, in_chunk_len, observed_cov_col_num)，因此需要将第一维(即 batch_size)打平，使其变为2维特征。

source: Default function for converting MLDataLoader to a numpy array that can be predicted by the pyod model.
ml: 默认的转换函数，用于将一个 MLDataLoader 对象转换为pyod第三方模型`predict`接口可接收的 numpy.ndarray 类型数据。

source: Make Wrapped time series model based on the third-party model.
ml: 基于第三方模型，构建时序模型。

source: User defined function for converting MLDataLoader object to a numpy.ndarray object that can be processed by `fit` method of the third party model. Any third party models that accept numpy array as fit inputs can use this function to build the data for training.
ml: 用户自定义函数，用于将一个 MLDataLoader 对象转换为第三方模型的`fit`接口可接收的 numpy.ndarray 类型数据。任何第三方模型的fit接口如果可以接收 numpy array 作为输入，则可以使用该函数构建训练数据。

source: User defined function for converting MLDataLoader object to a numpy.ndarray object that can be processed by `predict` method of the third party model. Any third-party models that accept numpy array as predict inputs can use this function to build the data for prediction.
ml: 用户自定义函数，用于将一个 MLDataLoader 对象转换为第三方模型的`fit`接口可接收的 numpy.ndarray 类型数据。任何第三方模型的fit接口如果可以接收 numpy array 作为输入，则可以使用该函数构建训练数据。

source: Wrapped time series model wrapper object, currently support SklearnModelWrapper and PyodModelWrapper.
ml: 封装完成的时序模型对象, 目前支持 SklearnModelWrapper 和 PyodModelWrapper。
