Repository: PaddlePaddle/PaddleTS
Catalog: docs/locale/*/LC_MESSAGES/source/api/paddlets.models.anomaly.*.pyod_models.po
Languages: ml

source: IForeast model for anomaly dection. Check https://github.com/yzhao062/pyod/blob/master/pyod/models/iforest.py for more information.
ml: 基于孤立森林的异常检测方法，更多详细信息请参考：https://github.com/yzhao062/pyod/blob/master/pyod/models/iforest.py。

source: The size of the loopback window, i.e. the number of time steps feed to the model.
ml: 模型输入的时间序列长度。

source: Sampling intervals between two adjacent samples, default=1.
ml: 相邻样本间的采样间隔。

source: The number of base estimators in the ensemble, default=100.
ml: 森林中生成的随机树数量，默认值100。

source: The number of samples to draw from X to train each base estimator, default="auto".
ml: 用来训练随机数的样本数量，即子采样的大小，默认值为auto。

source: The amount of contamination of the data set, float in (0., 0.5), default=0.1.
ml: 异常数据占给定的数据集的比例，范围为[0, 0.5]，默认值0.1。

source: The number of features to draw from X to train each base estimator, default=1.0.
ml: 指定从总样本X中抽取来训练每棵树iTree的属性的数量，默认只使用一个属性，默认值为1.0。

source: If True, individual trees are fit on random subsets of the training data sampled with replacement. If False, sampling without replacement is performed, default=False.
ml: 如果为True，则各个树可放回地对训练数据进行采样。如果为False，则执行不放回的采样，默认值为False。

source: The number of jobs to run in parallel for both `fit` and `predict`, if -1, then the number of jobs is set to the number of cores, default=1.
ml: 在运行fit()和predict()函数时并行运行的作业数量。除了在joblib.parallel_backend上下文的情况下，None表示为1。设置为-1则表示使用所有可用的处理器，默认值为1。

source: Behaviour of the ``decision_function`` which can be either 'old' or 'new', default="old".
ml: 默认为old。

source: Method of generating random seed, default=None.
ml: 生成随机种子的方法，默认值为None。

source: Controls the verbosity of the tree building process, default=0.
ml: 控制树构建过程的冗长性，默认值为0。

source: PCA model for anomaly dection. Check https://github.com/yzhao062/pyod/blob/master/pyod/models/pca.py for more information.
ml: 基于PCA的异常检测方法，更多详细信息请参考：https://github.com/yzhao062/pyod/blob/master/pyod/models/pca.py。

source: Number of components to keep, default=None.
ml: 指定希望PCA降维后的特征维度数目，默认值为None。

source: Number of selected principal components, default=None.
ml: 所选特征的数量,在计算异常值分数时选择多少特征进行计算，如果没有选，则采用全部的特征进行计算，默认值为None。

source: If False, data passed to fit are overwritten and running fit(X).transform(X) will not yield the expected results, use fit_transform(X) instead, default=True.
ml: 表示是否在运行算法时，将原始训练数据复制一份，默认值为True。

source: When True the `components_` vectors are multiplied by the square root of n_samples and then divided by the singular values to ensure uncorrelated outputs with unit component-wise variances, default=True.
ml: 是否进行白化，默认值为True。

source: String in {'auto', 'full', 'arpack', 'randomized'}, default="auto".
ml: 指定奇异值分解SVD的方法，由于特征分解是奇异值分解SVD的一个特例，一般的PCA库都是基于SVD实现，默认值为auto。

source: Tolerance for singular values computed by svd_solver == 'arpack', default=0.0.
ml: svd_solver =='arpack'时计算的奇异值的公差，默认值为0.0。

source: Number of iterations for the power method computed by svd_solver == 'randomized', default="auto".
ml: svd_solver =='randomized'时计算出的幂方法的迭代次数，默认值为auto。

source: If True, the eigenvalues are used in score computation, the eigenvectors with small eigenvalues comes with more importance, in outlier score calculation, default=True.
ml: 如果为True，特征值将参与分数计算，在异常值分数计算中，特征向量中特征值越小越重要，默认值为True。

source: If True, perform standardization first to convert data to zero mean and unit variance, default=True.
ml: 如果为True，将先对数据执行(0,1)标准化，默认值为True。

source: LOF model for anomaly dection. Check https://github.com/yzhao062/pyod/blob/master/pyod/models/lof.py for more information.
ml: 基于LOF的异常检测方法，更多详细信息请参考：https://github.com/yzhao062/pyod/blob/master/pyod/models/lof.py。

source: Number of neighbors to use by default for `kneighbors` queries, default=20.
ml: 取离样本点p第k个最近的距离，默认值为20。

source: String in {'auto', 'ball_tree', 'kd_tree', 'brute'}, default="auto".
ml: 内部采用什么算法实现，默认值为auto。

source: Leaf size passed to `BallTree` or `KDTree`, default=30.
ml: kd_tree或者ball_tree叶节点规模，默认值为30。

source: Metric used for the distance computation. Any metric from scikit-learn or scipy.spatial.distance can be used, default='minkowski'.
ml: 度量距离的方法，默认值是minkowski。

source: Parameter for the Minkowski metric from sklearn.metrics.pairwise.pairwise_distances, default=2.
ml: 闵氏距离各种不同的距离参数，默认值为2，即采样欧氏距离。

source: Additional keyword arguments for the metric function, default=None.
ml: 距离度量函数的额外关键字参数，默认值为None。

source: The number of parallel jobs to run for neighbors search, If ``-1``, then the number of jobs is set to the number of CPU cores, affects only kneighbors and kneighbors_graph methods, default=1.
ml: 在执行邻居搜索时并行运行的作业数量，默认值为1。

source: LocalOutlierFactor is only meant to be used for outlier detection (novelty=True), default=True.
ml: 异常检测模式，默认值为True。

source: KNN model for anomaly dection. Check https://github.com/yzhao062/pyod/blob/master/pyod/models/knn.py for more information.
ml: 基于KNN的异常检测方法，更多详细信息请参考：https://github.com/yzhao062/pyod/blob/master/pyod/models/knn.py。

source: Number of neighbors to use by default for k neighbors queries, default=5.
ml: 查询使用的邻居数，默认值为5。

source: String in {'largest', 'mean', 'median'}, default='largest'.
ml: 离群值得分的计算方法，默认值为largest。

source: Range of parameter space to use by default for `radius_neighbors` queries, default=1.0.
ml: 查询使用的参数空间范围，默认值为1.0。

source: String in {'auto', 'ball_tree', 'kd_tree', 'brute'}, algorithm used to compute the nearest neighbors, default="auto".
ml: 用于计算最近邻居的算法，默认值为auto。

source: Leaf size passed to BallTree, default=30.
ml: 传递给BallTree或KDTree的叶子大小，默认值为30。

source: OCSVM model for anomaly dection. Check https://github.com/yzhao062/pyod/blob/master/pyod/models/ocsvm.py for more information.
ml: 基于OCSVM的异常检测方法，更多详细信息请参考：https://github.com/yzhao062/pyod/blob/master/pyod/models/ocsvm.py。

source: String in {'linear', 'poly', 'rbf', 'sigmoid', 'precomputed'} or a callable, specifies the kernel type to be used in the algorithm, default='rbf'.
ml: 核函数，默认值为rbf。

source: Degree of the polynomial kernel function ('poly'), ignored by all other kernels, default=3.
ml: 阶数, 多项式内核函数（'poly'）的阶数, 默认值为3。

source: Kernel coefficient for 'rbf', 'poly' and 'sigmoid', if gamma is 'auto' then 1/n_features will be used instead, default="auto".
ml: 内核系数，默认值为auto。

source: Independent term in kernel function, it is only significant in 'poly' and 'sigmoid', default=0.0.
ml: 内核参数，默认值为0.0。

source: Tolerance for stopping criterion, default=1e-3.
ml: 停止标准的度量，默认值为0.001。

source: An upper bound on the fraction of training errors and a lower bound of the fraction of support vectors. Should be in the interval (0, 1], default=0.5.
ml: 训练误差分数的上限, 支持向量分数的下限, 范围是（0, 1]，默认值为0.5。

source: Whether to use the shrinking heuristic, default=True.
ml: 是否使用缩小的启发式方法，默认值为True。

source: Specify the size of the kernel cache (in MB), default=200.
ml: 指定内核缓存的大小，单位是MB，默认值为200。

source: Enable verbose output, default=False.
ml: 是否启用详细输出，默认值为False。

source: Hard limit on iterations within solver, or -1 for no limit, default=-1.
ml: 对求解器内的迭代进行硬性限制，默认值为-1。
